# TODO  Пользователи банкомата хотят снимать деньги.
#  Но банкомат умеет выдавать только купюры по 100 рублей.
#  Напишите программу,
#  которая проверяет допустимость суммы средств, которую ввёл пользователь.
#
#  Пример:
#  Введите сумму, которую хотите снять: 250
#  Такую сумму снять невозможно. Обратитесь в другой банкомат.
#  Введите сумму, которую хотите снять: 2000
#  Вот ваши 2000 рублей

#n = int(input("Введите сумму:"))

#if n % 100 == 0:
#    print("Заберите", n)
#else:
#    print("Данную сумму снять невозможно, обратитесь в другой банк")

#a = int(input("Введите сумму:"))
#result = "Заберите" if a % 100 == 0 else "Данную сумму снять невозможно, обратитесь в другой банк"
#print(result)
#Как сделать, если я хочу "заберите" вместе с суммой?
