# TODO Задача: Напишите программу,
#  которая получает на вход число n — количество минут, — затем считает,
#  сколько это будет в часах и сколько минут останется,
#  и выводит на экран эти два результата.

n = int(input())

# print("Часы", n//60, "Минуты", n % 60)

print(f'Часы {n//60} и Минуты {n % 60}')


