#  # Напишите программу,
#  которая запрашивает у пользователя длины двух катетов
#  в прямоугольном треугольнике и выводит его площадь.
#
# # Формула:
# # S = ab/2

# a = int(input())
# b = int(input())
#
# print("S = ", a*b/2)

# a = float(input())
# b = float(input())
#
# print("S = ", a*b/2)

a = float(input())
b = float(input())

print(f'S = {a * b / 2}') # Не забывай про пробелы!)
