# TODO Напишите программу, которая проверяет, чётное ли число ввёл пользователь,
#  и выводит соответствующее сообщение.
#  Подсказка: для проверки чётности используйте оператор %.

a = int(input())

if a % 2 == 0:
    print("четное")
else:
    print("нечетное")
