#print(f"{int(input()):+09}")
#это работает вроде

#print(f"{float(input()):#10.2f)}")
#с этим вариантом не получается совсем. не понимаю, как делать с плавующей точкой
#print(f"{int(input()):b_}")
#здесь не знаю, как разделить нижним подчеркиванием

#Необходимо написать программу, которая будет считывать три числа и выводить их в определенном формате.
# Первое число целое, второе с плавающей точкой, третье целое неотрицательное. По примерам необходимо определить требуемый формат данных.
#Входные данные

#  102
#  3.1415926535
#  1127
#Выходные данные

#  +000000102
#  #####3.14
#  0000_0100_0110_0111

#Входные данные

#  -1024
#  -123.7
#   65535
#Выходные данные

#  -000001024
#   ###-123.70
#   1111_1111_1111_1111


a = input()

print(a.replace(_old:"!@#%", _new:"len()").lower(a))
#здесь я тоже сдаюсь. я нихренашеньки не поняла.

#Необходимо написать программу, которая будет считывать со стандартного ввода строку, далее будет приводить ее к нижнему регистру,
# а также будет заменять символы “!”, “%”, “#”, “@” на пустую строку.
# В итоге нужно будет вывести в первой строке число замененных символов, а во второй преобразованную строку.

#Входные данные
#Hello World!@#%

#Выходные данные

#4
#hello world


